// /*++
// Copyright (c) 2009 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"


#string STR_BOARD_ID_NAME               #language en-US "BOARD ID"
#string STR_BOARD_ID_VALUE              #language en-US "N/A"

#string STR_MAIN                        #language en-US "Main"
#string STR_MAIN_HELP                   #language en-US "System Overview"
#string STR_LANGUAGE_HELP               #language en-US "Choose the system default language."
#string STR_LANGUAGE_PROMPT             #language en-US "System Language"

#string STR_BIOS_DATE_NAME              #language en-US "Build Date"
#string STR_BIOS_DATE_VALUE             #language en-US "N/A" //dynamically updated
#string STR_DATE                        #language en-US "System Date(MM/DD/YYYY)"
#string STR_DATE_HELP                   #language en-US "Set the Date. Use Tab key to switch between Date fields."
#string STR_TIME                        #language en-US "System Time(HH:MM:SS)"
#string STR_TIME_HELP                   #language en-US "Set the Time. Use Tab key to switch between Time fields."

#string STR_BIOS_VENDOR_NAME                    #language en-US "BIOS Vendor"
#string STR_BIOS_VENDOR_VALUE                   #language en-US "N/A"

#string STR_BIOS_VERSION_NAME                   #language en-US "BIOS Version"
#string STR_BIOS_VERSION_VALUE                  #language en-US "N/A"

#string STR_BIOS_DATE_NAME                      #language en-US "BIOS Date"
#string STR_BIOS_DATE_VALUE                     #language en-US "N/A"

#string STR_LOGIN_TYPE                          #language en-US "User Login Type"
#string STR_LOGIN_TYPE_VALUE                    #language en-US "N/A"

#string STR_CHIPVERSION_NAME                    #language en-US "Chip Version(SOC)"                                      #language zh-Hans "\wide中文\narrow"
#string STR_CHIPVERSION_VALUE                   #language en-US "N/A"

#string STR_CHIPVERSION_IOE_NAME                #language en-US "Chip Version(IOE)"                                      #language zh-Hans "\wide中文\narrow"
#string STR_CHIPVERSION_IOE_VALUE               #language en-US "N/A"

#string STR_LAN_MAC_ADDR_NAME                   #language en-US "Onboard LAN MAC Address"
#string STR_LAN_MAC_ADDR_VALUE                  #language en-US "Invalid"


#string STR_MEMORY_FREQ_NAME                          #language en-US "Memory Bus Speed"
#string STR_MEMORY_FREQ_HELP                          #language en-US "Displays the Frequency of Memory"
#string STR_MEMORY_FREQ_VALUE                         #language en-US "N/A" // Dynamically updated

#string STR_MEMORY_SIZE_NAME                          #language en-US "Installed Memory"
#string STR_MEMORY_SIZE_VALUE                         #language en-US "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP                          #language en-US "Total Memory in the System."
                                                      #language zh-Hans "Total Memory in the System."
						      
#string STR_PROCESSOR_VERSION                         #language en-US "CPU Type"
                                                      #language zh-Hans "\wide处理器类型\narrow"
#string STR_PROCESSOR_CORE_COUNT_STRING               #language en-US "CPU Core Count"
                                                      #language zh-Hans "\wide处理器核心数量\narrow"
#string STR_PROCESSOR_CORE_COUNT_VALUE                #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_MICROCODE                       #language en-US   "CPU MicroCode Patch Version"
                                                      #language zh-Hans "\wide处理器微码补丁版本\narrow"                                                      
#string STR_PROCESSOR_MICROCODE_VALUE                 #language en-US "N/A"
                                                      #language zh-Hans "N/A" 						      						      
#string STR_SYSTEM_SUMMARY                      #language en-US "System Summary"
                                                #language zh-Hans "System Summary"
#string STR_MACHINE_TYPE_MODEL_NAME             #language en-US "Machine Type and Model"
                                                #language zh-Hans "\wide主机型号和编码\narrow"
#string STR_SYSTEM_MANUFACTURER_NAME            #language en-US "System Manufacturer"
                                                #language zh-Hans "\wide主机商标标识\narrow"
#string STR_SYSTEM_SERIAL_NUMBER_NAME           #language en-US "System Serial Number"
                                                #language zh-Hans "\wide主机编号\narrow"
#string STR_ASSET_TAG_NAME                      #language en-US "Asset Tag"
                                                #language zh-Hans "\wide资产管理名称\narrow"
#string STR_SYSTEM_UUID_NAME                    #language en-US "System UUID"
                                                #language zh-Hans "\wide系统\narrowUUID"
#string STR_ASSET_TAG_VALUE                     #language en-US "N/A"
                                                #language zh-Hans "N/A"                                                
#string STR_SYSTEM_UUID_VALUE                   #language en-US "N/A"
                                                #language zh-Hans "N/A"                                                 
#string STR_SYSTEM_MANUFACTURER_VALUE           #language en-US "N/A"
                                                #language zh-Hans "N/A"                                                  
#string STR_SYSTEM_SERIAL_NUMBER_VALUE          #language en-US "N/A"
                                                #language zh-Hans "N/A"     
						
						
						